### Why Use Date and Time Data in Machine Learning?

**1. Adding Context to Data:**  
Date and time data provide essential context to other data points. For example, sales might be higher on weekends or during certain months. Understanding when data was collected helps in spotting patterns and trends.

**2. Time-Based Trends:**  
Many real-world phenomena change over time. For example, stock prices, weather conditions, and customer behavior all evolve. By including date and time in your model, you can capture these trends and make more accurate predictions.

**3. Seasonal Patterns:**  
Some patterns repeat over time, like higher ice cream sales in summer. Date and time data help in identifying and leveraging these seasonal patterns for better forecasting.

**4. Lagged Features:**  
Past data can influence future outcomes. By handling date and time, you can create lagged features (e.g., last month’s sales) that help predict future values.

**5. Time Series Data:**  
In time series analysis, the order of data points is crucial. Properly handling date and time ensures that your model understands the sequence and can make predictions based on the correct timeline.

### Why Handle Date and Time Carefully?

**1. Different Formats:**  
Date and time data come in various formats (e.g., "2024-08-18," "18/08/2024"). Properly handling these formats ensures your data is consistent and ready for analysis.

**2. Time Zones:**  
Data collected from different regions may have different time zones. Handling this correctly avoids errors, especially in global applications.

**3. Missing Data:**  
Sometimes, date and time data might be incomplete. Handling these gaps correctly is important to maintain the accuracy of your model.

**4. Complex Calculations:**  
Operations like calculating the difference between dates, or extracting specific parts (like the month or day) require careful handling to ensure correct results.

**5. Performance:**  
Handling date and time efficiently can improve the performance of your model, especially when working with large datasets.

These points ensure that you capture the full value of date and time data, leading to more accurate and reliable machine learning models.

In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
date.drop(columns=['product_id', 'city_id', 'orders'], inplace=True)

In [5]:
date.head()

         date
0  2019-12-10
1  2018-08-15
2  2018-10-23
3  2019-08-17
4  2019-01-06

In [6]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [7]:
time.drop(columns='msg', inplace=True)

In [8]:
time.head()

                  date
0  2013-12-15 00:50:00
1  2014-04-29 23:40:00
2  2012-12-30 00:21:00
3  2014-11-28 00:31:00
4  2013-10-26 23:11:00

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

In [10]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

# Working with Dates

In [11]:
# converting to datetime datetype
date['date'] = pd.to_datetime(date['date'])

In [12]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

<h5>1. Extract year</h5>

In [13]:
date['date_year'] = date['date'].dt.year

In [14]:
date.head()

        date  date_year
0 2019-12-10       2019
1 2018-08-15       2018
2 2018-10-23       2018
3 2019-08-17       2019
4 2019-01-06       2019

<h5>2. Extract month</h5>

In [15]:
date['date_month'] = date['date'].dt.month

In [16]:
date.head()

        date  date_year  date_month
0 2019-12-10       2019          12
1 2018-08-15       2018           8
2 2018-10-23       2018          10
3 2019-08-17       2019           8
4 2019-01-06       2019           1

In [17]:
date['month_name'] = date['date'].dt.month_name()

In [18]:
date.head()

        date  date_year  date_month month_name
0 2019-12-10       2019          12   December
1 2018-08-15       2018           8     August
2 2018-10-23       2018          10    October
3 2019-08-17       2019           8     August
4 2019-01-06       2019           1    January

<h5>3. Extract days</h5>

In [19]:
date['date_day'] = date['date'].dt.day

In [20]:
date.head()

        date  date_year  date_month month_name  date_day
0 2019-12-10       2019          12   December        10
1 2018-08-15       2018           8     August        15
2 2018-10-23       2018          10    October        23
3 2019-08-17       2019           8     August        17
4 2019-01-06       2019           1    January         6

In [21]:
# day of week
date['date_of_week'] = date['date'].dt.dayofweek

In [22]:
date.head()

        date  date_year  date_month month_name  date_day  date_of_week
0 2019-12-10       2019          12   December        10             1
1 2018-08-15       2018           8     August        15             2
2 2018-10-23       2018          10    October        23             1
3 2019-08-17       2019           8     August        17             5
4 2019-01-06       2019           1    January         6             6

In [23]:
date['date_dow_name'] = date['date'].dt.day_name()

In [24]:
date.head()

,date,date_year,date_month,month_name,date_day,date_of_week,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [25]:
# is weekend ?
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Saturday', 'Sunday']), 1, 0)

In [26]:
date.head()

,date,date_year,date_month,month_name,date_day,date_of_week,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

<h5>4. Extract week of the day</h5>

In [27]:
date['date_week'] = date['date'].dt.isocalendar().week

In [28]:
date.head()

,date,date_year,date_month,month_name,date_day,date_of_week,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

<h5>5. Extract quater</h5>

In [29]:
date['quater'] = date['date'].dt.quarter

In [30]:
date.head()

,date,date_year,date_month,month_name,date_day,date_of_week,date_dow_name,date_is_weekend,date_week,quater
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

<h5>6. Extract Semester</h5>

In [31]:
date['semester'] = np.where(date['quater'].isin([1, 2]), 1, 2)

In [32]:
date.head()

,date,date_year,date_month,month_name,date_day,date_of_week,date_dow_name,date_is_weekend,date_week,quater,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

<h5>7. Extract Time elapsed between dates</h5>

In [33]:
import datetime
today = datetime.datetime.today()

today

datetime.datetime(2024, 8, 18, 17, 41, 50, 95667)

In [34]:
today - date['date']

0     1713 days 17:41:50.095667
1     2195 days 17:41:50.095667
2     2126 days 17:41:50.095667
3     1828 days 17:41:50.095667
4     2051 days 17:41:50.095667
                 ...
995   2141 days 17:41:50.095667
996   2082 days 17:41:50.095667
997   1930 days 17:41:50.095667
998   1995 days 17:41:50.095667
999   1769 days 17:41:50.095667
Name: date, Length: 1000, dtype: timedelta64[ns]

In [35]:
# getting days only
(today - date['date']).dt.days

0      1713
1      2195
2      2126
3      1828
4      2051
       ...
995    2141
996    2082
997    1930
998    1995
999    1769
Name: date, Length: 1000, dtype: int64

In [36]:
# getting months Hours
np.round((today - date['date']) / np.timedelta64(1, 'h'), 0)  # also can use other things like months, day, hours, seconds, etc

0      41130.0
1      52698.0
2      51042.0
3      43890.0
4      49242.0
        ...
995    51402.0
996    49986.0
997    46338.0
998    47898.0
999    42474.0
Name: date, Length: 1000, dtype: float64

# time

In [37]:
time.head()

                  date
0  2013-12-15 00:50:00
1  2014-04-29 23:40:00
2  2012-12-30 00:21:00
3  2014-11-28 00:31:00
4  2013-10-26 23:11:00

In [38]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

In [39]:
# converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [40]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

<h5>1. Extract hour, minute, second</h5>

In [41]:
time['hour'] = time['date'].dt.hour
time['minute'] = time['date'].dt.minute
time['second'] = time['date'].dt.second

In [42]:
time.head()

                 date  hour  minute  second
0 2013-12-15 00:50:00     0      50       0
1 2014-04-29 23:40:00    23      40       0
2 2012-12-30 00:21:00     0      21       0
3 2014-11-28 00:31:00     0      31       0
4 2013-10-26 23:11:00    23      11       0

<h5>2. Extract only time part</h5>

In [43]:
time['time'] = time['date'].dt.time

In [44]:
time.head()

                 date  hour  minute  second      time
0 2013-12-15 00:50:00     0      50       0  00:50:00
1 2014-04-29 23:40:00    23      40       0  23:40:00
2 2012-12-30 00:21:00     0      21       0  00:21:00
3 2014-11-28 00:31:00     0      31       0  00:31:00
4 2013-10-26 23:11:00    23      11       0  23:11:00

<h5>3. Extract time difference</h5>

In [45]:
today - time['date']

0     3899 days 16:51:50.095667
1     3763 days 18:01:50.095667
2     4249 days 17:20:50.095667
3     3551 days 17:10:50.095667
4     3948 days 18:30:50.095667
                 ...
995   4538 days 16:51:50.095667
996   3859 days 18:27:50.095667
997   4324 days 18:04:50.095667
998   4440 days 18:07:50.095667
999   3712 days 18:16:50.095667
Name: date, Length: 1000, dtype: timedelta64[ns]

In [46]:
# in seconds
(today - time['date']) / np.timedelta64(1, 's')

0      3.369343e+08
1      3.251881e+08
2      3.671761e+08
3      3.068683e+08
4      3.411739e+08
           ...
995    3.921439e+08
996    3.334841e+08
997    3.736587e+08
998    3.836813e+08
999    3.207826e+08
Name: date, Length: 1000, dtype: float64

In [47]:
# in minutes
(today - time['date']) / np.timedelta64(1, 'm')

0      5.615572e+06
1      5.419802e+06
2      6.119601e+06
3      5.114471e+06
4      5.686231e+06
           ...
995    6.535732e+06
996    5.558068e+06
997    6.227645e+06
998    6.394688e+06
999    5.346377e+06
Name: date, Length: 1000, dtype: float64

In [48]:
# in hours
(today - time['date']) / np.timedelta64(1, 'h')

0       93592.863915
1       90330.030582
2      101993.347249
3       85241.180582
4       94770.513915
           ...
995    108928.863915
996     92634.463915
997    103794.080582
998    106578.130582
999     89106.280582
Name: date, Length: 1000, dtype: float64